app/controllers/announcements_controller.rb

  def index
    @announcements = Announcement.all
---
SELECT "announcements".* FROM "announcements"

  def create
    @announcement = Announcement.new(announcement_params)

    if @announcement.save
---
INSERT INTO "announcements" ("content", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Stand up at 9:00am"], ["course_id", 24], ["created_at", "2023-08-08 07:58:18.772172"], ["updated_at", "2023-08-08 07:58:18.772172"]]

  def set_announcement
    @announcement = Announcement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]