app/controllers/application_controller.rb

    def authorize_request
        jwt_cookie = cookies.signed[:jwt_token]

        if jwt_cookie
        begin
            @decoded = JsonWebToken.decode(jwt_cookie)
            @current_user = User.find(@decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]