app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "name", "course_id", "avatar", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)